Repository: OpenDataNode/ckanext-odn-pipeline
Catalog: ckanext/i18n/*/LC_MESSAGES/ckanext_odn_pipeline.po
Languages: sk

source: User {user} not authorized to edit {id}
sk: Používateľ {user} nie je oprávnený upravovať {id}

source: Dataset not found
sk: Dataset nebol nájdený

source: Unauthorized to read package {id}
sk: Nie ste oprávnený čítať dataset {id}

source: Next step
sk: Ďalší krok

source: Not implemented yet
sk: Zatiaľ nie je implementované

source: Action was not choosen!
sk: Nebola zvolená akcia!

source: Choose pipeline to copy.
sk: Zvoľte proces, ktorý sa má kopírovať.

source: Pipeline name is required.
sk: Meno procesu je povinné.

source: Pipeline wasn't created.
sk: Proces nebol vytvorený.

source: Pipeline is already associated to some dataset.
sk: Proces už je priradený k inému datasetu.

source: Pipeline {name} assigned successfully.
sk: Proces {name} úspešne priradený.

source: Couldn't create/associate pipeline: {error}
sk: Nepodarilo sa vytvoriť/priradiť proces: {error}

source: Connecting to UnifiedViews timed out.
sk: Vypršal čas pre pripojenie sa k Transformačnému modulu.

source: No pipeline selected.
sk: Nebol vybraný žiadny proces.

source: Pipeline assigned successfully.
sk: Proces bol priradený úspešne.

source: Couldn't remove pipeline, because there is no such pipeline assigned to this dataset.
sk: Nepodarilo sa odstrániť proces, žiadny taký proces nie je priradený datasetu.

source: Pipeline removed from dataset successfully
sk: Proces bol úspešne odstránený z datasetu

source: Couldn't execute pipeline: {error}
sk: Nepodarilo sa spustiť proces: {error}

source: internal api: Authentication failed.
sk: internal api: Neúspešná autentifikácia.

source: Error: Only logged in user can associate pipelines.
sk: Chyba: Len prihlásený používateľ môže priraďovať procesy.

source: Couldn't retrieve information about pipelines: {error}
sk: Nepodarilo sa získať informácia o procesoch: {error}

source: Couldn't retrieve information about pipelines.
sk: Nepodarilo sa získať informácia o procesoch.

source: Couldn't retrieve pipeline information: {error}
sk: Nepodarilo sa získať informácie o procese: {error}

source: Couldn't connect to UnifiedViews server.
sk: Nepodarilo sa spojiť so serverom Transformačného modulu

source: Couldn't get pipeline last execution information: {error}
sk: Nepodarilo sa získať informáciu o poslednom spustení procesu: {error}

source: Couldn't get pipeline next execution information: {error}
sk: Nepodarilo sa získať informáciu o ďalšom spustení procesu: {error}

source: Pipelines
sk: Procesy

source: Add pipeline
sk: Pridať proces

source: Action
sk: Akcia

source: Configure manually
sk: Editovať v Transformačnom module

source: Schedule
sk: Naplánovať

source: Execute now
sk: Spustiť teraz

source: Disassociate
sk: Zrušiť asociáciu

source: Last execution: {time}, last run status:
sk: Posledné spustenie: {time}, stav posledného behu:

source: Next execution:
sk: Ďalšie spustenie:

source: Not planned
sk: Nie je plánované

source: No pipelines assigned.
sk: Nebol priradený žiadny proces.

source: Choose existing pipeline
sk: Vybrať existujúci proces

source: Choose action
sk: Vyberte akciu

source: Existing pipeline
sk: Existujúci proces

source: Create new manually
sk: Vytvoriť nový proces manuálne

source: Create a modified copy of existing pipeline
sk: Vytvoriť modifikovanú kópiu existujúceho procesu

source: Back
sk: Naspäť

source: Advice
sk: Nápoveda

source: Add association to existing or newly created pipeline.
sk: Pridanie a úprava procesov na publikovanie dát do tohto datasetu.

source: Choose pipeline to copy
sk: Vybrať proces pre skopírovanie

source: Choose pipeline
sk: Vyberte proces

source: Select pipeline
sk: Vybrať proces

source: Selected pipeline description
sk: Popis vybraného procesu

source: N/A
sk: Nie je k dispozícii

source: Finish
sk: Dokončiť

source: Creating new pipeline
sk: Vytvorenie nového procesu

source: Create pipeline
sk: Vytvorte proces

source: Name
sk: Meno

source: Pipeline name
sk: Názov procesu

source: Description
sk: Popis

source: Pipeline description
sk: Popis procesu
